ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/core_modules/rf/src/ble_arp.c
    /* RSSI calculation formula:
     * The equation to use for Input Power = 0.498 * RSSI - 127,
     * where the RSSI is 8-bit value used by SDK.
     * The range of valid RSSI values is 40 to 230.
     * Any values lower then 40 should be ceiled to 40.
     * Any values higher than 230 should be floored to 230.
    */
    if (rssi_reg < 40)
    {
        RSSI_Value_temp = 40;
    }
    else if (rssi_reg > 230)
    {
        RSSI_Value_temp = 230;
    }

    if (RSSI_Value_temp == 0)
    {
       return (uint8_t) (-127);
    }
    else
    {
       return (uint8_t) ((uint8_t) (-127) + (uint8_t) ((498 * RSSI_Value_temp) / 1000));
    }
}

#ifdef CFG_BLE
/**
 ****************************************************************************************
 * @brief ISR to be called in BLE ISR routine when RF Interrupt occurs.
 *****************************************************************************************
 */
static void RADIOCNTL_Handler(void)
{
}

/**
 *****************************************************************************************
 * @brief Enable/disable force AGC mechanism
 *
 * @param[in]  True: Enable / False: disable
 *****************************************************************************************
 */
static void rf_force_agc_enable(bool en)
{
}
#endif //CFG_BLE

/**
 *****************************************************************************************
 * @brief Get the selected TX output power
 *
 * @param[in] conidx        Connection index (0xFF for advertising)
 * @param[in] req_pwr_level Requested power level (max or current)
 *
 * @return The selected TX output power
 *
 *****************************************************************************************
 */
#if !defined (__ES2_DA14531__)
static uint8_t rf_txpwr_dbm_get(uint8_t conidx, uint8_t req_pwr_level)
#else
static uint8_t rf_txpwr_dbm_get(uint8_t txpwr_idx, uint8_t modulation)
#endif
{
#if !defined (__ES2_DA14531__)
    rf_tx_pwr_lvl_t tx_pow_lvl = RF_TX_PWR_LVL_0d0;
    ASSERT_ERROR((req_pwr_level == TX_PWR_LVL_MAX) || (req_pwr_level == TX_PWR_LVL_CURRENT));
    ASSERT_ERROR((conidx < CFG_MAX_CONNECTIONS) || (conidx == 0xFF));

    if (conidx == 0xFF)
    {
        // Advertising mode
#if defined (CFG_ENHANCED_TX_PWR_CTRL)
        tx_pow_lvl = rf_pa_pwr_adv_get();
#else
        tx_pow_lvl = rf_pa_pwr_get();
#endif
    }
    else
    {
         // Connected mode
        if (req_pwr_level == TX_PWR_LVL_MAX)
        {
            tx_pow_lvl = RF_TX_PWR_LVL_PLUS_2d5;
        }
        else
        {
#if defined (CFG_ENHANCED_TX_PWR_CTRL)
            tx_pow_lvl = rf_pa_pwr_conn_get(conidx);
#else
            tx_pow_lvl = rf_pa_pwr_get();
#endif
        }
    }

    return (uint8_t) tx_pow_lvl;
#else
    return 0;
#endif
}

/**
 *****************************************************************************************
 * @brief Sleep function for the RF.
 *****************************************************************************************
 */
static void rf_sleep(void)
{
    ble_deepslcntl_set(ble_deepslcntl_get() |
                      BLE_DEEP_SLEEP_ON_BIT |    // RW BLE Core sleep
                      BLE_RADIO_SLEEP_EN_BIT |   // Radio sleep
                      BLE_OSC_SLEEP_EN_BIT);     // Oscillator sleep

    SetBits32(BLE_CNTL2_REG, BB_ONLY,0);
}

/**
 *****************************************************************************************
 * @brief Get RF preferred setting for radiopwrupdn.
 * 
 * For BLE this value will be increased with ARP_RX_DELAY and ARP_TX_DELAY
 * NOTE: BE AWARE THIS FUNCTION MAY BE CALLED ONLY ONCE, PREFERABLE DIRECT AFTER SET_RECOMMENDED_SETTINGS
 *****************************************************************************************
 */
static void update_radiopwrupdn_pref_setting(void)
{
    uint32_t reg = GetWord32(BLE_RADIOPWRUPDN_REG);
    uint32_t ble_rxpwrup = GetBits32(&reg, RXPWRUP) + ARP_RX_DELAY; 
    uint32_t ble_txpwrup = GetBits32(&reg, TXPWRUP) + ARP_TX_DELAY; 

    reg &= ~(RXPWRUP | TXPWRUP);
    reg |= (ble_rxpwrup << SHIF32(RXPWRUP)) | (ble_txpwrup << SHIF32(TXPWRUP));
    SetWord32(BLE_RADIOPWRUPDN_REG, reg);
}

/**
 *****************************************************************************************
 * @brief Initialization of RF registers.
 *****************************************************************************************
 */
static void rf_regs()
{
    syscntl_cfg_xtal32m_amp_reg(XTAL32M_AMP_REG_HOLD);      // switch to HOLD mode

    /***
     *** Init BLE
     ***/
    // Note: ble_report_check_rx() will toggle BLE_RSSI_SEL on each Rx !
    SetBits32(BLE_CNTL2_REG, BLE_RSSI_SEL, 0);    // 0: Select Peak-hold RSSI value (default), 1: Select current Average RSSI.

    SetWord32(BLE_RADIOCNTL1_REG, 0);
    
    SetBits32(BLE_RADIOCNTL1_REG, XRFSEL, 2);       // Select on-chip radio type: 2 is the only choice

    SetBits32(BLE_RWBLECNTL_REG, RXWINSZDEF, 14);   // Using 14us, just like final Application does.
                                                    // 10=recommended. 0 is not a valid value.
                                                    // Only in slave or initiator or scanner device and only during the 1st Rx
                                                    // the ctrl_struct->rxwinsz will be used.
}

/*
 * RADIO FUNCTION INTERFACE
 ****************************************************************************************
 */
#define EM_BLE_FREQ_TABLE_LEN       EM_RF_FREQ_TABLE_LEN

void rf_init_func(struct rwip_rf_api *api)
{
    uint8_t idx = 0;
    uint8_t temp_freq_tbl[EM_BLE_FREQ_TABLE_LEN];

    // Initialize the RF driver API structure
    api->reg_rd = rf_reg_rd;
    api->reg_wr = rf_reg_wr;
    api->txpwr_dbm_get = rf_txpwr_dbm_get;

    api->txpwr_max = 0;//RPL_POWER_MAX;
    api->sleep = rf_sleep;
    api->reset = rf_reset;
#if defined (CFG_BLE)
    api->isr = RADIOCNTL_Handler;
    api->force_agc_enable = rf_force_agc_enable;
#endif //CFG_BLE

    api->rssi_convert = rf_rssi_convert;

#if defined (CFG_BT)
    api->txpwr_inc = rf_txpwr_inc;
    api->txpwr_dec = rf_txpwr_dec;
    api->txpwr_epc_req = rf_txpwr_epc_req;
    api->txpwr_cs_get = rf_txpwr_cs_get;
    api->rssi_convert = rf_rssi_convert;
    api->rssi_high_thr = (uint8_t)RPL_RSSI_20dB_THRHLD;
    api->rssi_low_thr = (uint8_t)RPL_RSSI_60dB_THRHLD;
    api->rssi_interf_thr = (uint8_t)RPL_RSSI_70dB_THRHLD;
    #ifdef CFG_BTCORE_30
    api->wakeup_delay = RPL_WK_UP_DELAY;
    #endif //CFG_BTCORE_30
    api->skew = RPL_RADIO_SKEW;
#endif //CFG_BT

