ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/core_modules/rf/src/ble_arp.c
#if !defined (__FPGA__)
    rf_power_up();
#endif

    SetBits32(BLE_RADIOCNTL1_REG, XRFSEL, 2);

    SetBits32(BLE_CNTL2_REG, SW_RPL_SPI, 0);
    while (idx < EM_BLE_FREQ_TABLE_LEN) {
            temp_freq_tbl[idx] = idx ;
            idx++;
    }
    em_ble_burst_wr(&temp_freq_tbl[0], EM_FT_OFFSET, EM_BLE_FREQ_TABLE_LEN);

#if !defined (CFG_ENHANCED_TX_PWR_CTRL)
    // Initialize Tx output power level to default 0dBm
    rf_pa_pwr_set(RF_TX_PWR_LVL_0d0);

    //  Near Field Mode Enable
    if (rf_nfm_is_enabled())
    {
        rf_pa_pwr_set(RF_TX_PWR_LVL_MINUS_19d5);
    }
#else
    // Initialize Tx output power level to default 0dBm
    rf_pa_pwr_adv_set(RF_TX_PWR_LVL_0d0);
#endif

    // Activate ADPLL block to make its registers accessible
    rf_adplldig_activate();

    otp_cs_load_pd_rad();                // Preferred settings for PD_RAD from OTP CS
    
    otp_cs_load_pd_adpll();              // Preferred settings for PD_ADPLL from OTP CS

#if defined (CFG_ENHANCED_TX_PWR_CTRL)
    // NOTE: Needed in ble_update_arp() call below!!
    SetWord32(ADPLL_DIV_CTRL_REG, otp_cs_get_adpll_div_ctrl_0dBm());
#endif

    set_recommended_settings();          // Preferred settings

    update_radiopwrupdn_pref_setting();

    rf_regs();

    rf_calibration();                           // Calibration
    ble_update_arp();                           // update with cal results

    // Deactivate ADPLL. It will be automatically enabled during TX/RX event
    rf_adplldig_deactivate();
}

void rf_reinit_func(void)
{
    SetBits32(BLE_RADIOCNTL1_REG, XRFSEL, 2);
    SetBits32(BLE_RWBLECNTL_REG, SYNCERR, 0); //this must be always '0'

    SetBits16(CLK_RADIO_REG, RFCU_ENABLE, 1);

    if ( arch_clk_is_XTAL32( ) )
    {
        //If LP clock is XTAL32 in Boost mode set XTAL32K_CUR to 1.
        if (GetBits16(ANA_STATUS_REG, BOOST_SELECTED) == 0x1)
            SetBits16(CLK_XTAL32K_REG,  XTAL32K_CUR, 1);
    }

#if !defined (CFG_ENHANCED_TX_PWR_CTRL)
    //  Near Field Mode Enable
    if (rf_nfm_is_enabled())
    {
        rf_pa_pwr_set(RF_TX_PWR_LVL_MINUS_19d5);
    }
#endif

    // Activate ADPLL block to make its registers accessible
    rf_adplldig_activate();
    
    otp_cs_load_pd_rad();                // Trim values for PD_RAD from OTP CS
    
    otp_cs_load_pd_adpll();              // Trim values for PD_ADPLL from OTP CS

    set_recommended_settings();          // Preferred settings

    update_radiopwrupdn_pref_setting();

    rf_regs();

#if !defined (CFG_ENHANCED_TX_PWR_CTRL)
    ble_update_arp_adpll_div_val();
#endif

    // Deactivate ADPLL. It will be automatically enabled during TX/RX event
    rf_adplldig_deactivate();

#if defined (CFG_RF_DIAG_INT)
    #include "system_library.h"
    enable_rf_diag_irq(RF_DIAG_IRQ_MODE_RXTX); // argument is unused for DA14531
#endif
}

// definitions
/*
 * ARP - Automatic Radio Programming
 */
#define ARPT_PWR_ENTRIES    (1)

#if defined (CFG_ENHANCED_TX_PWR_CTRL)
#define ARPT_PREF_ENTRIES   (16)
#else
#define ARPT_PREF_ENTRIES   (14)
#endif

#define ARPT_TX_ENTRIES     (3)
#define ARPT_RX_ENTRIES     (3)

#if defined (CFG_ENHANCED_TX_PWR_CTRL)
#define ARPT_RF_PA_CTRL_REG_IDX     (13)
#define ARPT_RF_ATTR_REG_IDX        (14)
#endif

/*
 * ARP table entry definition
 */
typedef union {
    uint32_t value;
    struct {
        unsigned data      : 16;
        unsigned addr      : 14;
        unsigned data8or16n: 1;    // 1:8bit data, 0:16bit data
        unsigned valid     : 1;    // 1: valid, 0:invalid
    } bf;
} __attribute((aligned(4))) t_arp_reg;

/*
 * ARP Table structure
 */
struct s_arp_table {
    // ARPT_PWR
    t_arp_reg  arpt_pwr[ARPT_PWR_ENTRIES];
    uint32_t   null1;

    // ARPT_PREF
    uint16_t   tx_tbase;
    uint16_t   rx_tbase;
    t_arp_reg  arpt_pref[ARPT_PREF_ENTRIES];
    uint32_t   null2;

    // ARPT_TX
    t_arp_reg  tx_en_delay;
    t_arp_reg  arpt_tx[ARPT_TX_ENTRIES];
    uint32_t   null3;

    // ARPT_RX
    t_arp_reg  rx_en_delay;
    t_arp_reg  arpt_rx[ARPT_RX_ENTRIES];
    uint32_t   null4;
} __attribute((aligned(4)));


// arp_table has to be allocated after the freq_idx_table and before ctrl_struct
volatile struct s_arp_table      *arp_table;

static void ble_update_arp_adpll_calib_vals(void)
{
    //read out reg, be sure calibration has be done and adpll ldo-on and hclk-en
    arp_table->arpt_pref[4].bf.data = GetWord16(ADPLL_KDTCTDC_CAL_CTRL1_REG);
    arp_table->arpt_pref[5].bf.data = GetWord16(ADPLL_KDTCTDC_CAL_CTRL1_REG+2);
}

static void ble_update_arp_adpll_div_val(void)
{
    arp_table->arpt_pref[7].bf.data = GetWord16(ADPLL_DIV_CTRL_REG);
    arp_table->arpt_pref[8].bf.data = GetWord16(ADPLL_DIV_CTRL_REG+2);
}

static void ble_update_arp(void)
{
    ble_update_arp_adpll_calib_vals();
    ble_update_arp_adpll_div_val();
    arp_table->arpt_pref[3].bf.data = GetWord16(ADPLL_KDCO_CAL_CTRL1_REG);
    arp_table->arpt_pref[9].bf.data = GetWord16(ADPLL_ACC_CTRL_REG);
    arp_table->arpt_pref[10].bf.data = GetWord16(ADPLL_ACC_CTRL_REG+2);

//    arp_table->arpt_pref[xx].bf.data = GetWord16(ADPLL_DCOAMP_CAL_CTRL_REG);  For bit 0..15 an entry in ble_arp block is not necessary, is same as reset value
    arp_table->arpt_pref[11].bf.data = GetWord16(ADPLL_DCOAMP_CAL_CTRL_REG+2);

    arp_table->arpt_pref[12].bf.data = GetWord16(ADPLL_TXMOD_CTRL_REG);
}

const struct s_arp_table arp_init_table = {
    // ARPT_PWR
    .arpt_pwr[0].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & RF_RADIO_INIT_REG,
                      .data        = ADPLLDIG_PWR_SW1_EN,                                   // ADPLLDIG_LDO enable and set ADPLLDIG register file reset
                      .data8or16n  = 0,                                                     // Word write
    },

    // The delay between enabling ADPLLDIG_PWR_SW1_EN and the parsing of arpt_pref table is defined by RF_ADPLLDIG_CTRL_REG[PWR_SW_TIM_CTRL]

    // ARPT_PREF
    .arpt_pref[0].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (RF_RADIO_INIT_REG + 1),                    // 2nd byte address
                      .data        = (ADPLLDIG_HRESET_N | ADPLLDIG_HCLK_EN) >> 8,           // Release ADPLLDIG register file reset and enable the HCLK
                      .data8or16n  = 1,                                                     // Byte write
    },

    .arpt_pref[1].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_ANA_CTRL_REG + 1),
                      .data        = (0xFF) & ((ADPLL_ANA_CTRL_REG_RESET | 0xB00) >> 8),    // Pref setting (DTC offset)
                      .data8or16n  = 1,                                                     // Byte write
    },

    .arpt_pref[2].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_RFPT_CTRL_REG),
                      .data        = (0xFF) & (ADPLL_RFPT_CTRL_REG_RESET | INV_CKRFPT),     // Pref setting (Invert RFPT clock)
                      .data8or16n  = 1,                                                     // Byte write
    },

