ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/core_modules/rf/src/ble_arp.c
    .arpt_pref[3].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_KDCO_CAL_CTRL1_REG),
                      .data        = 0,                                                     // Dummy value it will be updated in ble_update_arp()
                      .data8or16n  = 0,                                                     // Word write
    },

    .arpt_pref[4].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_KDTCTDC_CAL_CTRL1_REG),
                      .data        = 0,                                                     // Dummy value it will be updated in ble_update_arp_adpll_calib_vals()
                      .data8or16n  = 0,                                                     // Word write
    },

    .arpt_pref[5].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_KDTCTDC_CAL_CTRL1_REG + 2),
                      .data        = 0,                                                     // Dummy value it will be updated in ble_update_arp_adpll_calib_vals()
                      .data8or16n  = 0,                                                     // Word write
    },

    .arpt_pref[6].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_OVERRULE_CTRL1_REG+1),
                      .data        = (0xFF) & ((OVR_VPAEN_WR | OVR_VPAEN_SEL) >> 8),        // Pref setting (VPA enable overrule)
                      .data8or16n  = 1,                                                     // Byte write
    },

    .arpt_pref[7].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_DIV_CTRL_REG),
                      .data        = 0,                                                     // Dummy value it will be updated in ble_update_arp_adpll_div_val()
                      .data8or16n  = 0,                                                     // Word write
    },

    .arpt_pref[8].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_DIV_CTRL_REG + 2),                   // 2nd word address
                      .data        = 0,                                                     // Dummy value it will be updated in ble_update_arp_adpll_div_val()
                      .data8or16n  = 0,                                                     // Word write
    },

    
    .arpt_pref[9].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_ACC_CTRL_REG),
                      .data        = 0,                                                     // Dummy value it will be updated in ble_update_arp()
                      .data8or16n  = 0,                                                     // Word write
    },

    .arpt_pref[10].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_ACC_CTRL_REG + 2),
                      .data        = 0,                                                     // Dummy value it will be updated in ble_update_arp()
                      .data8or16n  = 0,                                                     // Word write
    },

    
    .arpt_pref[11].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_DCOAMP_CAL_CTRL_REG + 2),
                      .data        = 0,                                                     // Dummy value it will be updated in ble_update_arp()
                      .data8or16n  = 0,                                                     // Word write
    },

    .arpt_pref[12].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (ADPLL_TXMOD_CTRL_REG),
                      .data        = 0,                                                     // Dummy value it will be updated in ble_update_arp()
                      .data8or16n  = 0,                                                     // Word write
    },

#if defined (CFG_ENHANCED_TX_PWR_CTRL)
    .arpt_pref[ARPT_RF_PA_CTRL_REG_IDX].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (RF_PA_CTRL_REG),
                      .data        = 0x300,                                                 // Set PA_RAMP_STEP_SPEED, TRIM_DUTY_NEG, TRIM_DUTY_POS (reset values)
                      .data8or16n  = 0,                                                     // Word write
    },

    .arpt_pref[ARPT_RF_ATTR_REG_IDX].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (RF_ATTR_REG + 2),                          // 2nd word address
                      .data        = (RF_TX_PWR_LVL_0d0 << 8),                              // Set output power to default 0dBm
                      .data8or16n  = 0,                                                     // Word write
    },
#endif

    .arpt_pref[ARPT_PREF_ENTRIES - 1].bf = {                                                // This must always be the last entry
                      .valid       = 1,
                      .addr        = (0x7FFF) & (RF_RADIO_INIT_REG + 1),                    // 2nd byte address
                      .data        = (ADPLLDIG_HRESET_N >> 8),                              // Disable ADPLLDIG register interface clock
                      .data8or16n  = 1,                                                     // Byte write
    },

    // ARPT_TX
    .tx_en_delay.bf = {
                      .valid       = 1,
                      .data        = ARP_TX_DELAY,
                      .addr        = 0,                                                     // Dummy value
    },

    .arpt_tx[0].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (RF_RADIO_INIT_REG ),
                      .data        = (ADPLLDIG_PWR_SW1_EN | ADPLLDIG_HRESET_N | ADPLLDIG_HCLK_EN),     // Release ADPLLDIG register file reset and enable the HCLK
                      .data8or16n  = 0,                                                     // Word write
    },

    .arpt_tx[1].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & ADPLL_CN_CTRL_REG,                          // addr section defines the location where arp_cn[] should be written
                      .data        = 0,                                                     // Don't care, arp_cn[] comes from the BLE block
                      .data8or16n  = 1,                                                     // Byte write
    },

    .arpt_tx[2].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (RF_RADIO_INIT_REG + 2),                    // 2nd byte address
                      .data        = (RADIO_REGS_RDY | ADPLLDIG_HCLK_DIS) >> 16,            // Disable ADPLLDIG register interface clock and set the RADIO_REGS_RDY bit field to 1
                      .data8or16n  = 1,                                                     // Byte write
    },

    // ARPT_RX
    .rx_en_delay.bf = {
                      .valid       = 1,
                      .data        = ARP_RX_DELAY,                                          // ARP_RX_DELAY JS
                      .addr        = 0,                                                     // Dummy value
    },

