ananawaretrk/Opal_Fcc_nrf52810/3rd_party/6.0.12.1020.2/sdk/platform/core_modules/rf/src/ble_arp.c
    .arpt_rx[0].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (RF_RADIO_INIT_REG),
                      .data        = (ADPLLDIG_PWR_SW1_EN | ADPLLDIG_HRESET_N | ADPLLDIG_HCLK_EN), // Release ADPLLDIG register file reset and enable the HCLK
                      .data8or16n  = 0,                                                     // Word write
    },

    .arpt_rx[1].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & ADPLL_CN_CTRL_REG,                          // addr section defines the location where arp_cn[] should be written. arp_cn[] comes from the BLE block
                      .data        = 0,                                                     // Don't care, arp_cn[] comes from the BLE block
                      .data8or16n  = 1,                                                     // Byte write
    },

    .arpt_rx[2].bf = {
                      .valid       = 1,
                      .addr        = (0x7FFF) & (RF_RADIO_INIT_REG + 2),                    // 2nd byte address
                      .data        = (RADIO_REGS_RDY | ADPLLDIG_HCLK_DIS) >> 16,            // Disable ADPLLDIG register interface clock and set the RADIO_REGS_RDY bit field to 1
                      .data8or16n  = 1,                                                     // Byte write
    },
};

/*********************************************************************************
 *** ble_init_arp()
 *** About: Load ARP Table values.
 ***        must be executed after ble_init_em()
 ***        in order to have the table pointer up to date and have the Table preloaded with zeros.
 ***/
void ble_init_arp_func(uint32_t base_addr)
{
    arp_table = (struct s_arp_table *) (uint32_t)(base_addr + EM_RF_ARP_OFFSET);

    ASSERT_WARNING(sizeof(arp_init_table) <= EM_RF_ARP_SIZE_MAX);

    memcpy((uint32_t *)arp_table, &arp_init_table, sizeof(arp_init_table));

    arp_table->tx_tbase                   = (uint32_t)&(arp_table->tx_en_delay) - (uint32_t)base_addr;
    arp_table->rx_tbase                   = (uint32_t)&(arp_table->rx_en_delay) - (uint32_t)base_addr;
}

void rf_recalibration(void) 
{
    rf_adplldig_activate();
    otp_cs_load_pd_adpll();              // Trim values for PD_ADPLL from OTP CS

    set_recommended_settings();          // Preferred settings
    update_radiopwrupdn_pref_setting();

    rf_calibration();                    // Calibration
    ble_update_arp_adpll_calib_vals();

    // Deactivate ADPLL. It will be automatically enabled during TX/RX event
    rf_adplldig_deactivate();
}

#if defined (CFG_ENHANCED_TX_PWR_CTRL)
/// BLE RF mode
typedef enum
{
    /// Advertising mode
    RF_PWR_MODE_ADV = 0,

    /// Connected mode
    RF_PWR_MODE_CONN = 1
} rf_pwr_mode_t;

/**
 ****************************************************************************************
 * @brief Helper function being called by @c ble_arp_update_tx_pwr.
 * @param[in] pwr_mode The BLE RF mode: advertising; connected.
 * @param[in] conidx The connection index.
 * @return void
 ****************************************************************************************
 */
static void update_pwr(rf_pwr_mode_t pwr_mode, uint8_t conidx)
{
    rf_tx_pwr_lvl_t tx_pwr;

    if (pwr_mode == RF_PWR_MODE_ADV)
    {
        // BLE RF advertising mode
        tx_pwr = rf_pa_pwr_adv_get();
    }
    else
    {
        // BLE RF connected mode
        tx_pwr = rf_pa_pwr_conn_get(conidx);
    }

    // Differentiate loaded settings based on 3dBm or 0dBm
    // 0dBm mode for any power setting equal to 9 or lower; 3dBm for 10 or higher
    if (tx_pwr > RF_TX_PWR_LVL_0d0)
    {
        // Use TRIM_DUTY_NEG and TRIM_DUTY_POS for 3dBm (residing in the lower
        // 16 bits of RF_PA_CTRL_REG)
        arp_table->arpt_pref[ARPT_RF_PA_CTRL_REG_IDX].bf.data = (uint16_t) otp_cs_get_rf_pa_ctrl_3dBm();

        // Use TXDIV_TRIM for 3dBm (residing in the upper 16 bits of ADPLL_DIV_CTRL_REG)
        arp_table->arpt_pref[8].bf.data = (uint16_t) (otp_cs_get_adpll_div_ctrl_3dBm() >> 16);

        // Load user radio power settings depending on the detected mode
        arp_table->arpt_pref[ARPT_RF_ATTR_REG_IDX].bf.data = (tx_pwr << 8);
    }
    else
    {
        // Use TRIM_DUTY_NEG and TRIM_DUTY_POS for 0dBm (residing in the lower
        // 16 bits of RF_PA_CTRL_REG)
        arp_table->arpt_pref[ARPT_RF_PA_CTRL_REG_IDX].bf.data = (uint16_t) otp_cs_get_rf_pa_ctrl_0dBm();

        // Use TXDIV_TRIM for 0dBm (residing in the upper 16 bits of ADPLL_DIV_CTRL_REG)
        arp_table->arpt_pref[8].bf.data = (uint16_t) (otp_cs_get_adpll_div_ctrl_0dBm() >> 16);

        if (rf_nfm_is_enabled())
        {
            // Near Field Mode Enable
            arp_table->arpt_pref[ARPT_RF_ATTR_REG_IDX].bf.data = (RF_TX_PWR_LVL_MINUS_19d5 << 8);
        }
        else
        {
            // Load user radio power settings depending on the detected mode
            arp_table->arpt_pref[ARPT_RF_ATTR_REG_IDX].bf.data = (tx_pwr << 8);
        }
    }
}

/**
 ****************************************************************************************
 * @brief Updates the radio output power depending on the detected BLE event.
 * @return void
 ****************************************************************************************
 */
void ble_arp_update_tx_pwr(void)
{
    // Get the scheduled BLE event
    struct ea_elt_tag *elt  = (struct ea_elt_tag *) co_list_pick(&lld_evt_env.elt_prog);
    struct lld_evt_tag *evt = LLD_EVT_ENV_ADDR_GET(elt);

    if (evt->mode == LLD_EVT_ADV_MODE)
    {
        update_pwr(RF_PWR_MODE_ADV, 0);
    }
    else if ((evt->mode == LLD_EVT_MST_MODE) || (evt->mode == LLD_EVT_SLV_MODE))
    {
        update_pwr(RF_PWR_MODE_CONN, evt->conhdl);
    }
}
#endif // CFG_ENHANCED_TX_PWR_CTRL

#endif // __DA14531__
